АлогистикТест2/src/Documents/алк_ВыгрузкаИзСушильнойКамеры/алк_ВыгрузкаИзСушильнойКамеры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_ВыгрузкаИзСушильнойКамеры</name>
  <basedOn>Document.алк_ЗагрузкаВСушильнуюКамеру</basedOn>
  <registerRecords>AccumulationRegister.алк_ЗапасыОрганизации</registerRecords>
  <registerRecords>AccumulationRegister.алк_ЗапасыНаСкладахСерии</registerRecords>
  <registerRecords>AccumulationRegister.алк_ОстаткиЗапасов</registerRecords>
  <registerRecords>AccumulationRegister.алк_ПроизводствоОборот</registerRecords>
  <registerRecords>AccumulationRegister.алк_ПакетыВСушильныхКамерах</registerRecords>
  <registerRecords>AccumulationRegister.алк_ОстаткиЛесопродукции</registerRecords>
  <registerRecords>AccumulationRegister.алк_ПиломатериалыПереданныеНаСушку</registerRecords>
  <registerRecords>InformationRegister.алк_ПараметрыПакетов</registerRecords>
  <attributes>
    <name>СменаУдалить</name>
    <type>
      <types>EnumRef.Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.алк_ЗагрузкаВСушильнуюКамеру</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СушильнаяКамера</name>
    <type>
      <types>CatalogRef.алк_СушильныеКамеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Участок</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Номенклатура</name>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>CatalogRef.СерийныеНомера</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Сертификат</name>
      <type>
        <types>CatalogRef.СертификатыНаПродукцию</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Продан</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/InformationRegisters/алк_ПараметрыПакетов/алк_ПараметрыПакетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>алк_ПараметрыПакетов</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>НомерПакета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПериодПакета</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоСостав</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </resources>
  <resources>
    <name>СертификатFSC</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОбъемТаможня</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВесНеттоТаможня</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВесБруттоТаможня</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПериодУпаковки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>БоковаяДоска</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Сертификат</name>
    <type>
      <types>CatalogRef.СертификатыНаПродукцию</types>
    </type>
  </resources>
  <resources>
    <name>Габарит</name>
    <type>
      <types>EnumRef.алк_ГабаритПакета</types>
    </type>
  </resources>
  <resources>
    <name>КатегорияНоменклатурыПЭО</name>
    <type>
      <types>CatalogRef.алк_КатегорияНоменклатурыПЭО</types>
    </type>
  </resources>
  <resources>
    <name>Сухой</name>
    <comment>Для пакетов СП</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Припуск</name>
    <type>
      <types>CatalogRef.алк_ВариантыПрипуска</types>
    </type>
  </resources>
  <resources>
    <name>ПризнакНЗП</name>
    <type>
      <types>EnumRef.алк_ПризнакНЗП</types>
    </type>
  </resources>
  <dimensions>
    <name>СерийныйНомер</name>
    <type>
      <types>CatalogRef.СерийныеНомера</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

АлогистикТест2/src/Enums/алк_ВидыОперацийПеремещениеЗапасов/алк_ВидыОперацийПеремещениеЗапасов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>алк_ВидыОперацийПеремещениеЗапасов</name>
  <enumValues>
    <name>ПередачаИзПроизводства</name>
  </enumValues>
  <enumValues>
    <name>ВозвратНаПроизводство</name>
  </enumValues>
  <enumValues>
    <name>ПередачаНаПроизводство</name>
  </enumValues>
  <enumValues>
    <name>ВозвратИзПроизводства</name>
  </enumValues>
  <enumValues>
    <name>ПолучениеРасформированныхПакетов</name>
  </enumValues>
  <enumValues>
    <name>ПередачаНаУпаковку</name>
  </enumValues>
  <enumValues>
    <name>ПередачаНаЦПШ</name>
  </enumValues>
  <enumValues>
    <name>ПередачаНаСобственные</name>
  </enumValues>
  <enumValues>
    <name>ПередачаНаРеализацию</name>
  </enumValues>
  <enumValues>
    <name>РеализацияЭкспорт</name>
  </enumValues>
  <enumValues>
    <name>РасформированиеПакета</name>
  </enumValues>
  <enumValues>
    <name>ПередачаСПереупаковки</name>
  </enumValues>
  <enumValues>
    <name>ПередачаНаОтветхранение</name>
  </enumValues>
  <enumValues>
    <name>ОприходованиеСОтветхранения</name>
  </enumValues>
  <enumValues>
    <name>ПриемкаС_ЦПШ</name>
  </enumValues>
  <enumValues>
    <name>ПриемкаСОтветхранения</name>
  </enumValues>
  <enumValues>
    <name>ПередачаНаПереупаковку</name>
  </enumValues>
  <enumValues>
    <name>ПередачаНаСушку</name>
  </enumValues>
  <enumValues>
    <name>ПередачаССушки</name>
  </enumValues>
  <enumValues>
    <name>Инвентаризация</name>
  </enumValues>
  <enumValues>
    <name>ЗагрузкаВСушильнуюКамеру</name>
  </enumValues>
  <enumValues>
    <name>ВыгрузкаИзСушильнойКамеры</name>
  </enumValues>
  <enumValues>
    <name>Перемещение</name>
  </enumValues>
  <enumValues>
    <name>ПередачаВНезавершенноеПроизводство</name>
  </enumValues>
  <enumValues>
    <name>ПередачаСНезавершенногоПроизводства</name>
  </enumValues>
  <enumValues>
    <name>ПриемкаНаСГП</name>
  </enumValues>
  <enumValues>
    <name>ПередачаССушкиСырых</name>
  </enumValues>
  <enumValues>
    <name>ПередачаИзПроизводства_УПП</name>
  </enumValues>
  <enumValues>
    <name>ПередачаИзПроизводства_УРП_СГП</name>
  </enumValues>
  <enumValues>
    <name>ПередачаИзПроизводства_УРП_Магазин</name>
  </enumValues>
</mdclass:Enum>

АлогистикТест2/src/Enums/алк_ВидыДвиженияПроизводствоОборот/алк_ВидыДвиженияПроизводствоОборот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>алк_ВидыДвиженияПроизводствоОборот</name>
  <enumValues>
    <name>Списано</name>
  </enumValues>
  <enumValues>
    <name>Оприходовано</name>
  </enumValues>
  <enumValues>
    <name>Отходы</name>
  </enumValues>
</mdclass:Enum>

АлогистикТест2/src/Documents/алк_ВыгрузкаИзСушильнойКамеры/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	#Область ИнициализацияДаных
	
	// Инициализирует таблицы значений, содержащие данные табличных частей документа.
	// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
	//
	Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаВыгрузкаИзСушильнойКамеры, СтруктураДополнительныеСвойства) Экспорт
		
		ТекстЗапроса = ТекстЗапросаДанныеДокумента();
		
		ДанныеДокументаВыгрузкаИзСушильнойКамеры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументСсылкаВыгрузкаИзСушильнойКамеры, "Смена, Дата, СушильнаяКамера");
		
		Запрос = Новый Запрос;
		Запрос.Текст = ТекстЗапроса;
		Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаВыгрузкаИзСушильнойКамеры);
		Запрос.УстановитьПараметр("Период", ДанныеДокументаВыгрузкаИзСушильнойКамеры.Дата);
		Запрос.УстановитьПараметр("ВидДвиженияПриход", ВидДвиженияНакопления.Приход);
		Запрос.УстановитьПараметр("ВидДвиженияРасход", ВидДвиженияНакопления.Расход);
		Запрос.УстановитьПараметр("Смена", ДанныеДокументаВыгрузкаИзСушильнойКамеры.Смена);
		Запрос.УстановитьПараметр("ЯчейкаВыгрузки", ПолучитьЯчейкуПоКамере(ДанныеДокументаВыгрузкаИзСушильнойКамеры.СушильнаяКамера));
		Запрос.УстановитьПараметр("ОперацияВыгрузка", Перечисления.алк_ВидыОперацийПеремещениеЗапасов.ВыгрузкаИзСушильнойКамеры);
		Запрос.УстановитьПараметр("ШтабельВыгрузки", ПолучитьШтабельПоКамере(ДанныеДокументаВыгрузкаИзСушильнойКамеры.СушильнаяКамера));
		
		//Дубоделов Э.А 13.02.2023
		//Параметр, отвечающий за формирование таблиц с движениями по алк_ПроизводствоОборот и алк_ОстаткиЗапасов
		ЗаписыватьДвиженияВНовыеРегистры = РФП_ПроведениеДокументовСервер.ЗаписыватьДвиженияВНовыеРегистры(ДанныеДокументаВыгрузкаИзСушильнойКамеры.Дата); 
		
        Запрос.УстановитьПараметр("ЗаписыватьДвиженияВНовыеРегистры", ЗаписыватьДвиженияВНовыеРегистры);
		//Дубоделов Э.А
		
		МассивРезультатовЗапроса = Запрос.ВыполнитьПакет();
		
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗапасыОрганизации", 			МассивРезультатовЗапроса[1].Выгрузить());
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("алк_ПакетыВСушильныхКамерах", 			МассивРезультатовЗапроса[2].Выгрузить());
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("алк_ПиломатериалыПереданныеНаСушку", 	МассивРезультатовЗапроса[3].Выгрузить());
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗапасыНаСкладахСерии", 			МассивРезультатовЗапроса[4].Выгрузить());
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПараметрыПакетов",	 			МассивРезультатовЗапроса[5].Выгрузить());
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаОстаткиЛесопродукции",  		МассивРезультатовЗапроса[6].Выгрузить());
		
		Если ЗаписыватьДвиженияВНовыеРегистры Тогда
			СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаОстаткиЗапасов",  			МассивРезультатовЗапроса[7].Выгрузить());
			СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПроизводствоОборот",  		МассивРезультатовЗапроса[8].Выгрузить());
		КонецЕсли;
		
	КонецПроцедуры

	#КонецОбласти
	
		
	#Область СервисныеПроцедурыИФункции

	Функция ПолучитьШтабельПоКамере(СушильнаяКамера);
		
		Штабель = Справочники.алк_Штабели.НайтиПоНаименованию("Сушильная камера " + СушильнаяКамера); 
		
		Возврат Штабель;
		
	КонецФункции

		
	Функция ПолучитьЯчейкуПоКамере(СушильнаяКамера)
		
		Если Не ЗначениеЗаполнено(СушильнаяКамера) Тогда			
			Возврат Справочники.Ячейки.ПустаяСсылка();			
		КонецЕсли; 
		
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Ячейки.Ссылка
		|ИЗ
		|	Справочник.Ячейки КАК Ячейки
		|ГДЕ
		|	Ячейки.Наименование = &Наименование";
		
		Запрос.УстановитьПараметр("Наименование", "Сушильная камера " + СушильнаяКамера);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если РезультатЗапроса.Пустой() Тогда
			
			НоваяЯчейка = Справочники.Ячейки.СоздатьЭлемент();	
			НоваяЯчейка.Владелец = Справочники.СтруктурныеЕдиницы.НайтиПоКоду("ПБ-000031"); // Сушильный комплекс
			НоваяЯчейка.Наименование =  "Сушильная камера " + СушильнаяКамера;			
			НоваяЯчейка.Записать();
			
		    Возврат НоваяЯчейка.Ссылка;
			
		КонецЕсли; 
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Возврат ВыборкаДетальныеЗаписи.Ссылка;
		КонецЦикла;
				
	КонецФункции // ПолучитьЯчейкуПоКамере()
	
	Функция ТекстЗапросаДанныеДокумента()
		
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	&Период КАК Период,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Ссылка.Организация КАК Организация,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.СерийныйНомер КАК СерийныйНомер,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Номенклатура КАК Номенклатура,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Характеристика КАК Характеристика,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Сертификат КАК Сертификат,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Количество КАК Количество,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Объем КАК Объем,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Ссылка.СушильнаяКамера КАК СушильнаяКамера,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.НомерСтроки КАК НомерСтроки,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Ссылка.Участок
		|ПОМЕСТИТЬ ВТ_ТаблицаДвижений
		|ИЗ
		|	Документ.алк_ВыгрузкаИзСушильнойКамеры.Номенклатура КАК алк_ВыгрузкаИзСушильнойКамерыНоменклатура
		|ГДЕ
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Период,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Период КАК ДатаСмены,
		|	&ВидДвиженияПриход КАК ВидДвижения,
		|	&Смена,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Организация,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.СтруктурнаяЕдиница,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.СерийныйНомер,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Номенклатура,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Характеристика,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Сертификат,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Количество,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Объем,
		|	ЗНАЧЕНИЕ(Справочник.Ячейки.ПустаяСсылка) КАК Ячейка
		|ИЗ
		|	ВТ_ТаблицаДвижений КАК алк_ВыгрузкаИзСушильнойКамерыНоменклатура
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Период,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Период,
		|	&ВидДвиженияРасход,
		|	&Смена,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Организация,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.СтруктурнаяЕдиница,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.СерийныйНомер,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Номенклатура,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Характеристика,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Сертификат,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Количество,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Объем,
		|	&ЯчейкаВыгрузки
		|ИЗ
		|	ВТ_ТаблицаДвижений КАК алк_ВыгрузкаИзСушильнойКамерыНоменклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Период,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Период КАК ДатаСмены,
		|	&ВидДвиженияРасход КАК ВидДвижения,
		|	&Смена,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Организация,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.СтруктурнаяЕдиница,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.СерийныйНомер,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Номенклатура,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Характеристика,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Сертификат,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Количество,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Объем,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.СушильнаяКамера
		|ИЗ
		|	ВТ_ТаблицаДвижений КАК алк_ВыгрузкаИзСушильнойКамерыНоменклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Период,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Период КАК ДатаСмены,
		|	&ВидДвиженияПриход КАК ВидДвижения,
		|	&Смена,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Организация,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.СтруктурнаяЕдиница,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.СерийныйНомер,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Номенклатура,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Характеристика,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Сертификат,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Количество,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Объем,
		|	ИСТИНА КАК Сухой
		|ИЗ
		|	ВТ_ТаблицаДвижений КАК алк_ВыгрузкаИзСушильнойКамерыНоменклатура
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Период,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Период,
		|	&ВидДвиженияРасход,
		|	&Смена,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Организация,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.СтруктурнаяЕдиница,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.СерийныйНомер,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Номенклатура,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Характеристика,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Сертификат,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Количество,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Объем,
		|	ЛОЖЬ
		|ИЗ
		|	ВТ_ТаблицаДвижений КАК алк_ВыгрузкаИзСушильнойКамерыНоменклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Период,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Период КАК ДатаСмены,
		|	&ВидДвиженияПриход КАК ВидДвижения,
		|	&Смена,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Организация,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.СтруктурнаяЕдиница,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.СерийныйНомер,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Номенклатура,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Характеристика,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Сертификат,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Количество,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Объем,
		|	ЗНАЧЕНИЕ(Справочник.Ячейки.ПустаяСсылка) КАК Ячейка,
		|	1 КАК КоличествоПакетов,
		|	&ОперацияВыгрузка КАК Операция
		|ИЗ
		|	ВТ_ТаблицаДвижений КАК алк_ВыгрузкаИзСушильнойКамерыНоменклатура
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Период,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Период,
		|	&ВидДвиженияРасход,
		|	&Смена,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Организация,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.СтруктурнаяЕдиница,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.СерийныйНомер,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Номенклатура,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Характеристика,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Сертификат,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Количество,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Объем,
		|	&ЯчейкаВыгрузки,
		|	1,
		|	&ОперацияВыгрузка
		|ИЗ
		|	ВТ_ТаблицаДвижений КАК алк_ВыгрузкаИзСушильнойКамерыНоменклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТаблицаДвижений.Период,
		|	&Ссылка,
		|	ВТ_ТаблицаДвижений.НомерСтроки,
		|	ВТ_ТаблицаДвижений.Номенклатура,
		|	алк_ПараметрыПакетовСрезПоследних.Активность,
		|	алк_ПараметрыПакетовСрезПоследних.СерийныйНомер,
		|	алк_ПараметрыПакетовСрезПоследних.НомерПакета,
		|	алк_ПараметрыПакетовСрезПоследних.ПериодПакета,
		|	алк_ПараметрыПакетовСрезПоследних.КоличествоСостав,
		|	алк_ПараметрыПакетовСрезПоследних.Объем,
		|	алк_ПараметрыПакетовСрезПоследних.Характеристика,
		|	алк_ПараметрыПакетовСрезПоследних.СертификатFSC,
		|	алк_ПараметрыПакетовСрезПоследних.ОбъемТаможня,
		|	алк_ПараметрыПакетовСрезПоследних.ВесНеттоТаможня,
		|	алк_ПараметрыПакетовСрезПоследних.ВесБруттоТаможня,
		|	алк_ПараметрыПакетовСрезПоследних.ПериодУпаковки,
		|	алк_ПараметрыПакетовСрезПоследних.БоковаяДоска,
		|	алк_ПараметрыПакетовСрезПоследних.Сертификат,
		|	алк_ПараметрыПакетовСрезПоследних.Габарит,
		|	алк_ПараметрыПакетовСрезПоследних.КатегорияНоменклатурыПЭО,
		|	ИСТИНА КАК Сухой
		|ИЗ
		|	ВТ_ТаблицаДвижений КАК ВТ_ТаблицаДвижений
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыПакетов.СрезПоследних(
		|				&Период,
		|				СерийныйНомер В
		|					(ВЫБРАТЬ
		|						ВТ_ТаблицаДвижений.СерийныйНомер
		|					ИЗ
		|						ВТ_ТаблицаДвижений КАК ВТ_ТаблицаДвижений)) КАК алк_ПараметрыПакетовСрезПоследних
		|		ПО ВТ_ТаблицаДвижений.СерийныйНомер = алк_ПараметрыПакетовСрезПоследних.СерийныйНомер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Период,
		|	&ВидДвиженияРасход КАК ВидДвижения,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Организация,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.СтруктурнаяЕдиница,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Номенклатура,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Характеристика,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Сертификат,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Количество,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Объем,
		|	&ЯчейкаВыгрузки КАК Ячейка,
		|	ИСТИНА КАК ЭтоСушильнаяКамера
		|ИЗ
		|	ВТ_ТаблицаДвижений КАК алк_ВыгрузкаИзСушильнойКамерыНоменклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТаблицаДвижений.Период КАК Период,
		|	ВТ_ТаблицаДвижений.Организация КАК Организация,
		|	ВТ_ТаблицаДвижений.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	&ШтабельВыгрузки КАК Штабель,
		|	ВТ_ТаблицаДвижений.Номенклатура КАК Номенклатура,
		|	ВТ_ТаблицаДвижений.Характеристика КАК Характеристика,
		|	ВТ_ТаблицаДвижений.Сертификат КАК Сертификат,
		|	ВТ_ТаблицаДвижений.СерийныйНомер КАК СерийныйНомер,
		|	ВТ_ТаблицаДвижений.Объем КАК Количество,
		|	ЗНАЧЕНИЕ(ВидДВиженияНакопления.Расход) КАК ВидДвижения
		|ИЗ
		|	ВТ_ТаблицаДвижений КАК ВТ_ТаблицаДвижений
		|ГДЕ
		|	&ЗаписыватьДвиженияВНовыеРегистры = ИСТИНА
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_ТаблицаДвижений.Период,
		|	ВТ_ТаблицаДвижений.Организация,
		|	ВТ_ТаблицаДвижений.СтруктурнаяЕдиница,
		|	NULL,
		|	ВТ_ТаблицаДвижений.Номенклатура,
		|	ВТ_ТаблицаДвижений.Характеристика,
		|	ВТ_ТаблицаДвижений.Сертификат,
		|	ВТ_ТаблицаДвижений.СерийныйНомер,
		|	ВТ_ТаблицаДвижений.Объем,
		|	ЗНАЧЕНИЕ(ВидДВиженияНакопления.Приход)
		|ИЗ
		|	ВТ_ТаблицаДвижений КАК ВТ_ТаблицаДвижений
		|ГДЕ
		|	&ЗаписыватьДвиженияВНовыеРегистры = ИСТИНА
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТаблицаДвижений.Период КАК Период,
		|	NULL КАК Бригада,
		|	ЗНАЧЕНИЕ(Перечисление.алк_ВидыДвиженияПроизводствоОборот.Списано) КАК ВидДвиженияПроизводства,
		|	ВТ_ТаблицаДвижений.Период КАК ДатаСмены,
		|	ВТ_ТаблицаДвижений.Номенклатура КАК Номенклатура,
		|	ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Сушка) КАК Операция,
		|	ВТ_ТаблицаДвижений.Организация КАК Организация,
		|	ВТ_ТаблицаДвижений.СерийныйНомер КАК СерийныйНомер,
		|	ВТ_ТаблицаДвижений.Сертификат КАК Сертификат,
		|	ВТ_ТаблицаДвижений.СтруктурнаяЕдиница КАК Склад,
		|	&Смена КАК Смена,
		|	ВТ_ТаблицаДвижений.Характеристика КАК Характеристика,
		|	ВТ_ТаблицаДвижений.Количество КАК Количество,
		|	ВТ_ТаблицаДвижений.Участок КАК Участок
		|ИЗ
		|	ВТ_ТаблицаДвижений КАК ВТ_ТаблицаДвижений
		|ГДЕ
		|	&ЗаписыватьДвиженияВНовыеРегистры = ИСТИНА
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_ТаблицаДвижений.Период,
		|	NULL,
		|	ЗНАЧЕНИЕ(Перечисление.алк_ВидыДвиженияПроизводствоОборот.Оприходовано),
		|	ВТ_ТаблицаДвижений.Период,
		|	ВТ_ТаблицаДвижений.Номенклатура,
		|	ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Сушка),
		|	ВТ_ТаблицаДвижений.Организация,
		|	ВТ_ТаблицаДвижений.СерийныйНомер,
		|	ВТ_ТаблицаДвижений.Сертификат,
		|	ВТ_ТаблицаДвижений.СтруктурнаяЕдиница,
		|	&Смена,
		|	ВТ_ТаблицаДвижений.Характеристика,
		|	ВТ_ТаблицаДвижений.Количество,
		|	NULL
		|ИЗ
		|	ВТ_ТаблицаДвижений КАК ВТ_ТаблицаДвижений
		|ГДЕ
		|	&ЗаписыватьДвиженияВНовыеРегистры = ИСТИНА";
		
		Возврат ТекстЗапроса;
		
	КонецФункции
	
	#КонецОбласти
	
	
	
#КонецЕсли
